InformationRegisters/ЗапланированныеДействияСФайламиДокументовКЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЗапланированныеДействияСФайламиДокументовКЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗадания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаетПодписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрисоединенныйФайл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрисоединенныйФайлПечатнойФормы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияСФайламиДокументовКЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДействияСФайламиДокументовКЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ДействияСФайламиДокументовКЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подписать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправитьПоПочте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьВКабинетСотрудников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьНаРаботаВРоссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписатьНаДиск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ознакомиться</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/БизнесПроцессыЗаявокСотрудниковСобытия/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ЗавершитьЗаявкиСотрудниковПослеПодписанияСправок() Экспорт
	
	Если Не Константы.ЗавершатьЗаявкиСотрудниковПослеПодписанияСправки.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	БизнесПроцессыЗаявокСотрудников.ЗавершитьЗаявкиСотрудникаСПодписаннымФайломОтвета();
	
КонецПроцедуры

Процедура ОтметитьОжидающиеПодписиЗаявкиСотрудника(Источник) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользуетсяКадровыйЭДОКабинетСотрудника") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Отбор.Действие.Значение <> Перечисления.ДействияСФайламиДокументовКЭДО.Подписать Тогда
		Возврат;
	КонецЕсли;
	
	ПрисоединенныйФайл = Источник.Отбор.ПрисоединенныйФайл.Значение;
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапланированныеДействияСФайламиДокументовКЭДО.ПрисоединенныйФайл КАК ПрисоединенныйФайл
	               |ИЗ
	               |	РегистрСведений.ЗапланированныеДействияСФайламиДокументовКЭДО КАК ЗапланированныеДействияСФайламиДокументовКЭДО
	               |ГДЕ
	               |	ЗапланированныеДействияСФайламиДокументовКЭДО.ПрисоединенныйФайл = &ПрисоединенныйФайл
	               |	И ЗапланированныеДействияСФайламиДокументовКЭДО.Исполнитель <> &Исполнитель
	               |	И ЗапланированныеДействияСФайламиДокументовКЭДО.Действие = &Действие";
	
	Запрос.УстановитьПараметр("ПрисоединенныйФайл", ПрисоединенныйФайл);
	Запрос.УстановитьПараметр("Исполнитель", Источник.Отбор.Исполнитель.Значение);
	Запрос.УстановитьПараметр("Действие", Источник.Отбор.Действие.Значение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПолноеУдаление = (Выборка.Количество() = 0) И Источник.Количество() = 0;
	
	ТипПрисоединенныйФайл = ТипЗнч(ПрисоединенныйФайл);
	
	Если ТипПрисоединенныйФайл = Тип("СправочникСсылка.СправкаНДФЛПрисоединенныеФайлы") Тогда
		БизнесПроцессы.ЗаявкаСотрудникаСправка2НДФЛ.ОтметитьОжидаетПодписание(
			ПрисоединенныйФайл,
			ПолноеУдаление);
		Возврат;		
	КонецЕсли;
	
	ТипЗаявкаСотрудникаСправкаСМестаРаботы = БизнесПроцессыЗаявокСотрудниковВнутренний.ТипЗаявкаСотрудникаСправкаСМестаРаботы();
	Если ТипЗаявкаСотрудникаСправкаСМестаРаботы = Тип("Неопределено") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПрисоединенныеФайлыСправкаСМестаРаботы = РаботаСФайламиСлужебный.ИмяСправочникаХраненияФайлов(
													Новый(ТипЗаявкаСотрудникаСправкаСМестаРаботы));
	Если ТипПрисоединенныйФайл = Тип("СправочникСсылка."+ИмяПрисоединенныеФайлыСправкаСМестаРаботы) Тогда	
		БизнесПроцессыЗаявокСотрудниковВнутренний.ОтметитьОжидаетПодписиЗаявкаСотрудникаСправкаСМестаРаботы(
			ПрисоединенныйФайл,
			ПолноеУдаление);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
